---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.ForwardIterator
source: html/9bd6d1c0-7b07-6824-cc99-42f64d43771d.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireConduitTypeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.